[ {
  "_id": 1,
  "projectName": "ApplyMate",
  "projectImage": "https://i.ibb.co.com/d0fqbfWt/readmeimg.png",
  "slogan": "ApplyMate is an AI-powered platform that helps job seekers organize and track all their job applications in one place.",
  "features": [
  "Smart Dashboard - View all applications with real-time status and progress charts.",
  "Resume Builder - Build professional resumes with templates and PDF export.",
  "AI Chrome Extension - Scrape jobs from any site and save automatically.",
  "AI Gmail Integration - Detect job emails and auto-update application status.",
  "Application Management - Add, edit, delete applications and track details.",
  "Advanced Search & Filter - Filter, search, and sort applications easily.",
  "Analytics & Insights - Track application success rates and trends visually.",
  "AI-Powered Analytics - Get insights, predictions, and application recommendations."
]
,
  "technologies": [
    "Next.js 15.5 (App Router)",
    "React 19.1 (Vite)",
    "NextAuth.js",
    "Tailwind CSS",
    "Google OAuth ",
    "Nodemailer",
    "Google Gemini 2.0 Flash",
    "React Query",
    "Framer Motion",
    "Radix",
    "MongoDB Atlas",
    "Cloudinary",
    "Vercel"
  ],
  "liveLink": "https://apply-mate-two.vercel.app/",
  "clientLink": "https://github.com/sanjidaRimi023/apply_mate",
  "serverLink": "https://github.com/sanjidaRimi023/apply_mate",
  "description": "Its helps users organize, track, and manage their job and internship applications efficiently. Keep all your applications in one place, set reminders, and stay updated with deadlines to maximize your opportunities."
},
  {
    "_id": 2,
    "projectName": "Book Galaxy",
    "projectImage": "https://i.ibb.co.com/x8zbD9Z5/Screenshot-2025-09-13-231814.png",
    "slogan": "Book Galaxy built with React, Firebase, and MongoDB. This project main theme CRUD operation with book related product.",
    "features": [
      "Authentication with Firebase (Login/Register)",
      "Book Management - Add, Edit, Delete Books",
      "Borrow & Return System with user dashboard",
      "Filter by Categories to explore books",
      "Book Ratings & Tips from users",
      "Protected Routes using JWT & PrivateRoute"
    ],
    "technologies": [
      "React",
      "Firebase",
      "MongoDB",
      "Lottie-React",
      "React-router-dom",
      "React-hook-form",
      "React-icons",
      "React-simple-typewriter",
      "React-tooltip",
      "Sweetalert2",
      "Swiper",
      "Tailwind CSS",
      "DaisyUI",
      "React-helmet"
    ],
    "liveLink": "https://book-galaxy-610c0.web.app/",
    "clientLink": "https://github.com/sanjidaRimi023/book-galaxy-client",
    "serverLink": "https://github.com/sanjidaRimi023/book-galaxy-server",
    "description": "Book Galaxy is a modern, responsive, and feature-rich Book Management Platform built using React, Firebase Authentication, Tailwind CSS, Framer Motion, and MongoDB (via a backend API). It allows users to explore books by category, borrow and return them, manage their library, and much more."
  },
  {
    "_id": 3,
    "projectName": "The Daily Bulletin",
    "projectImage": "https://i.ibb.co.com/7J0fR98r/the-dailybulletin.png",
    "slogan": "A modern, full-stack newspaper platform with role-based access, payments, and dynamic dashboards.",
    "features": [
      "Fully Responsive Design - Suitable for all devices, including mobile, tablet, and desktop",
      "User Authentication - Easy registration and login with Email/Password and Google",
      "Role-Based Interface - Separate dashboards and features for regular users, premium users, and administrators",
      "Article Management - Users can easily add, update, and delete their news articles",
      "Dynamic Dashboard - Data visualization with charts using Recharts",
      "Fast Data Loading - Uses TanStack Query for efficient fetching and caching",
      "Payment System - Secure subscription purchases through Stripe"
    ],
    "technologies": [
      "React.js",
      "MongoDB",
      "Express.js",
      "Node.js",
      "React Router",
      "Tailwind CSS",
      "Miraki UI",
      "TanStack Query",
      "Axios",
      "React Hook Form",
      "Firebase Authentication",
      "Recharts",
      "Framer Motion",
      "Swiper.js",
      "React CountUp",
      "SweetAlert2",
      "React-Toastify"
    ],
    "liveLink": "https://daily-bulletin-96f27.web.app",
    "clientLink": "https://github.com/sanjidaRimi023/the-dailybulletin-client",
    "serverLink": "https://github.com/sanjidaRimi023/the-dailybulletin-server",
    "description": "The Daily Bulletin The Daily Bulletin is a modern, full-stack newspaper platform built with the MERN stack (MongoDB, Express.js, React.js, Node.js). It offers a seamless and interactive experience for reading, writing, and managing news articles, featuring role-based access for regular users, premium subscribers, and administrators."
  },
  {
    "_id": 4,
    "projectName": "WorkLynx",
    "projectImage": "https://i.ibb.co.com/Rp3xQ294/Screenshot-2025-09-13-232020.png",
    "slogan": "WorkLynx is a dynamic freelance task marketplace designed to bridge the gap between clients and freelancers.",
   "features": [
    "Authentication System - Email/Password login & registration, Google Sign-In, Protected routes with access control",
    "Task Management (CRUD) - Add, update, delete, and view tasks, Browse all public tasks, See your own posted tasks in a private dashboard",
    "Bid Counter System - Task detail pages show a dynamic bid count, Bid count updates with each click",
    "Responsive UI - Fully responsive layout for mobile, tablet, and desktop users, Inspired by modern freelance platforms with a unique twist",
    "Design & UI Libraries - TailwindCSS, DaisyUI, Lucide Icons, Swiper, Lottie animations, React Simple Typewriter adds a playful dynamic touch"
  ],
    "technologies": [
    "React 19 (Vite)",
    "React Router v7",
    "Firebase Auth & Hosting",
    "Axios",
    "Tailwind CSS",
    "DaisyUI",
    "SweetAlert2",
    "React Toastify",
    "Lottie",
    "Swiper",
    "Node.js",
    "Express.js",
    "MongoDB (with Mongoose)",
    "RESTful APIs",
    "CORS & environment variable protection"
  ],
    "liveLink": "https://work-lynx.firebaseapp.com",
    "clientLink": "https://github.com/sanjidaRimi023/workLynx-client",
    "serverLink": "https://github.com/sanjidaRimi023/worklynx-server",
    "description": "WorkLynx is a modern freelance task marketplace that connects clients and freelancers. Users can post tasks, browse projects, place bids, and manage their freelance listings easily. The platform offers a smooth, responsive interface built with React, Vite, Tailwind CSS, DaisyUI, and interactive libraries like Lottie and Swiper. Firebase handles secure authentication, including email/password login, Google Sign-In, and role-based access control. The backend, powered by Node.js, Express.js, and MongoDB, manages all task data with full CRUD operations and real-time bid updates. WorkLynx provides a reliable, feature-rich experience for managing freelance work efficiently."
  },
 {
  "_id": 5,
  "projectName": "ClayCraft",
  "projectImage": "https://i.ibb.co.com/gLf650QH/Screenshot-2025-09-13-172915.png",
  "slogan": "ClayCraft is my very first Next.js e-commerce styled project with authentication and modern UI.",
  "features": [
    " User Authentication with NextAuth.js (App Router)",
    " Modern UI with TailwindCSS and lucide-react icons",
    " File Upload support using react-dropzone",
    " Custom dropdowns with react-select",
    " User-friendly notifications with react-hot-toast",
    " Alerts & confirmations with SweetAlert2",
    " Deployed on Vercel with MongoDB Atlas integration"
  ],
  "technologies": [
    "Next.js 14 (App Router)",
    "NextAuth.js",
    "Tailwind CSS",
    "Lucide React Icons",
    "React Dropzone",
    "React Select",
    "React Hot Toast",
    "SweetAlert2",
    "MongoDB Atlas",
    "Cloudinary",
    "Vercel"
  ],
  "liveLink": "https://claycrafts.vercel.app/",
  "clientLink": "https://github.com/sanjidarimi023/claycraft",
  "serverLink": "N/A",
  "description": "ClayCraft is a basic e-commerce type project and my first Next.js application. It uses NextAuth.js for authentication, MongoDB Atlas as the database, and Vercel for deployment. The UI is designed with TailwindCSS and enhanced with lucide-react icons. The project also supports file uploads with react-dropzone, custom dropdowns using react-select, notifications with react-hot-toast, and interactive alerts with SweetAlert2. Future plans include adding a full shopping cart system, payment gateway integration, order management, and product reviews & ratings."
}

]